HTML_and_CSS_Design_and_Build_Websites/019.Practical_Information/019.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-16 Sun 20:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 19: Practical Information</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 19: Practical Information</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc783f99">Navigation</a></li>
<li><a href="#org0f9d60c">Notes</a>
<ul>
<li><a href="#org3608d9b">Section 19.1: Search Engine Optimization (SEO)</a>
<ul>
<li><a href="#orga63ed76">Section 19.1.1: On-Page SEO</a></li>
<li><a href="#org19935d0">Section 19.1.2: How to Identify Keywords &amp; Phrases</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd838192">Keywords</a></li>
<li><a href="#orgbd41095">Questions</a></li>
<li><a href="#org04c448c">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc783f99" class="outline-2">
<h2 id="orgc783f99">Navigation</h2>
<div class="outline-text-2" id="text-orgc783f99">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">HTML &amp; CSS - Design and Build Websites</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Chapter 18: Process &amp; Design</td>
<td class="org-left">&vert; <a href="../018.Process_and_Design/018.000.Notes.html">html</a> &vert; <a href="../018.Process_and_Design/018.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/HTML_and_CSS_Design_and_Build_Websites/018.Process_and_Design">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0f9d60c" class="outline-2">
<h2 id="org0f9d60c">Notes</h2>
<div class="outline-text-2" id="text-org0f9d60c">
</div>
<div id="outline-container-org3608d9b" class="outline-3">
<h3 id="org3608d9b">Section 19.1: Search Engine Optimization (SEO)</h3>
<div class="outline-text-3" id="text-org3608d9b">
<ul class="org-ul">
<li>Search engine optimization (or SEO) is the practice of trying to help your site appear nearer the top of search engine results when people look for the topics that your website covers</li>
<li>At the heart of SEO is the idea of working out which terms people are likely to enter into a search engine to find your site and then using these terms in the right places on your site to increase the chances that search engines will show a link to your site in their results (now SEO is much more than that)</li>
<li>Search engines also consider how many sites link to your and how relevant those links are</li>
<li>Thus SEO is split into two areas: on-page techniques and off-page techniques</li>
<li>On-page techniques are the methods you can use on your web pages to improve their rating in search engines such as looking at keywords that people are likely to enter into a search engine if they wanted to find your site and then including these in the text in HTML code for your site in order to help search engines know that your site covers these topics</li>
<li>Search engines rely on text in your pages so it is important that the terms people are going to search for are actually in your page text</li>
<li>If you have any images then always including the <code>alt</code> attribute helps search engines understand the content of images</li>
<li>Off-page techniques deal with other sites having links to your web page which helps search engines determine how to rank your site</li>
<li>Search engines are interested in sites whose content is related to yours and it looks for the words used to describe the link (e.g. "click here" is not relevant but "Geroge Washington (Wikipedia)" may be more relevant if you want to learn about George Washington), the link contains keywords it may be considered more relevant</li>
<li>The words that appear in links to your site should also appear in the text of the page that the site links to, all of these helps the site rank higher than others if it has links from other web pages that are similar and use keywords for the links that are already present in the original site</li>
</ul>
</div>

<div id="outline-container-orga63ed76" class="outline-4">
<h4 id="orga63ed76">Section 19.1.1: On-Page SEO</h4>
<div class="outline-text-4" id="text-orga63ed76">
<ul class="org-ul">
<li>In your page of your website there are seven key places where keywords (the words people might search on to find your site) can appear in order to improve its findability:
<ol class="org-ol">
<li>Page Title: Specified in the <code>&lt;title&gt;</code> element which lives inside the <code>&lt;head&gt;</code> element</li>
<li>URL: The name of the file is part of the URL, where possible use the keywords in the file name</li>
<li>Headings: If keywords are in a heading element then a search engine will know that this page is all about the subject and give it greater weight than other text</li>
<li>Text: Where possible, it helps to repeat the keywords in the main body of the text at least 2-3 times but do not over-use these terms because the text must be easy for a human to read</li>
<li>Link Text: Use keywords in the text that create links between pages, don't use generic words such as "click here"</li>
<li>Image Alt Text: Search engines rely on you providing accurate descriptions on images in the alt text and this will also show up in the results of image-based searches</li>
<li>Page Descriptions: The description lives inside the <code>&lt;head&gt;</code> element and is specified using a <code>&lt;meta&gt;</code> tag, the description should be a sentence that describes the content of the page, these descriptions may not be shown in the browser window but they may be displayed in the results of search engines</li>
</ol></li>
<li>Never try to fool search engines because they will penalize you for it (e.g. add a bunch of keywords repeatedly but use the same color as the background or make it transparent because search engines will know)</li>
</ul>
</div>
</div>

<div id="outline-container-org19935d0" class="outline-4">
<h4 id="org19935d0">Section 19.1.2: How to Identify Keywords &amp; Phrases</h4>
</div>
</div>
</div>


<div id="outline-container-orgd838192" class="outline-2">
<h2 id="orgd838192">Keywords</h2>
<div class="outline-text-2" id="text-orgd838192">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbd41095" class="outline-2">
<h2 id="orgbd41095">Questions</h2>
<div class="outline-text-2" id="text-orgbd41095">
<ul class="org-ul">
<li><b>Q</b>: Has SEO changed over time? How does SEO work now? And how can I optimize SEO for my website?</li>
</ul>
</div>
</div>

<div id="outline-container-org04c448c" class="outline-2">
<h2 id="org04c448c">Summary</h2>
</div>
</div>
</body>
</html>
